#    -*- mode: org -*-


Archived entries from file /home/yantar92/Git/emacs-config/config.org
***** DONE make a babel :wrap snippet aka (when init-flag BODY)
CLOSED: [2019-12-19 Thu 12:52] SCHEDULED: <2019-12-19 Thu>
:PROPERTIES:
:ARCHIVE_TIME: 2019-12-22 Sun 00:40
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-19 Thu 12:52]
CLOCK: [2019-12-19 Thu 12:11]--[2019-12-19 Thu 12:52] =>  0:41
- State "DONE"       from "DOING"      [2019-12-18 Wed 18:16]
- State "DONE"       from "NEXT"          [2019-12-18 Wed 18:16]
CLOCK: [2019-12-18 Wed 17:05]--[2019-12-18 Wed 18:16] =>  1:11
CLOCK: [2019-12-18 Wed 16:46]--[2019-12-18 Wed 17:04] =>  0:18
:END:

***** DONE [#A] make sure it works
CLOSED: [2019-12-27 Fri 23:03] SCHEDULED: <2019-12-22 Sun>
:PROPERTIES:
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Appearance/Mini-buffer/Stack messages in mini-buffer when they appear quickly after each other
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-27 Fri 23:03]
CLOCK: [2019-12-27 Fri 22:57]--[2019-12-27 Fri 23:03] =>  0:06
CLOCK: [2019-12-22 Sun 16:22]--[2019-12-22 Sun 17:13] =>  0:51
:END:
***** FAILED [#A] this example seems to be wrong |- (alphapapa/org-ql: An Org-mode query language, including search commands and saved views) :BOOKMARK:
CLOSED: [2019-12-27 Fri 16:52] SCHEDULED: <2019-12-23 Mon>
:PROPERTIES:
:CREATED: [2019-12-22 Sun 19:27]
:Source: https://github.com/alphapapa/org-ql
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: FAILED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "FAILED"     from "NEXT"          [2019-12-27 Fri 16:52] \\
  It's fine
CLOCK: [2019-12-27 Fri 16:35]--[2019-12-27 Fri 16:52] =>  0:17
- Refiled on [2019-12-23 Mon 18:08]
- Refiled on [2019-12-23 Mon 10:57]
:END:
 ((org-ql-block-header "SOMEDAY :Emacs: High-priority")))
***** DONE [#A] ignoring "B" default priority in org-ql is not in github page
CLOSED: [2019-12-27 Fri 16:57] SCHEDULED: <2019-12-23 Mon>
:PROPERTIES:
:CREATED: [2019-12-22 Sun 19:43]
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-27 Fri 16:57]
CLOCK: [2019-12-27 Fri 16:52]--[2019-12-27 Fri 16:57] =>  0:05
- Refiled on [2019-12-23 Mon 18:08]
- Refiled on [2019-12-23 Mon 10:57]
CLOCK: [2019-12-22 Sun 19:43]--[2019-12-22 Sun 19:44] =>  0:01
:END:
***** DONE [#A] org-ql-block does not apply link face when link is in heading
CLOSED: [2019-12-27 Fri 16:59] SCHEDULED: <2019-12-23 Mon>
:PROPERTIES:
:CREATED: [2019-12-22 Sun 19:55]
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-27 Fri 16:59]
CLOCK: [2019-12-27 Fri 16:57]--[2019-12-27 Fri 16:59] =>  0:02
- Refiled on [2019-12-23 Mon 18:08]
- Refiled on [2019-12-23 Mon 10:57]
:END:
***** CANCELLED [#A] how to emulate org-tags-match-list-sublevels from agenda in org-ql? :CANCELLED:
CLOSED: [2019-12-27 Fri 17:27] SCHEDULED: <2019-12-23 Mon>
:PROPERTIES:
:CREATED: [2019-12-23 Mon 14:39]
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: CANCELLED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "CANCELLED"  from "NEXT"          [2019-12-27 Fri 17:27]
CLOCK: [2019-12-27 Fri 17:12]--[2019-12-27 Fri 17:27] =>  0:15
- Refiled on [2019-12-23 Mon 18:08]
- Refiled on [2019-12-23 Mon 18:05]
:END:
***** MERGED [#A] What about looking at ancestors?
CLOSED: [2019-12-27 Fri 17:12] SCHEDULED: <2019-12-24 Tue>
:PROPERTIES:
:CREATED:  [2019-12-24 Tue 14:48]
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: MERGED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "MERGED"     from "NEXT"          [2019-12-27 Fri 17:12]
CLOCK: [2019-12-27 Fri 17:10]--[2019-12-27 Fri 17:12] =>  0:02
:END:
***** DONE [#A] the following happens when I try to change the todo state of a task in org-ql
CLOSED: [2019-12-27 Fri 17:06] SCHEDULED: <2019-12-26 Thu>
:PROPERTIES:
:CREATED: [2019-12-25 Wed 15:46]
:ID:       afafd4b1-fdca-4126-a69f-e690373e662f
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-27 Fri 17:06]
CLOCK: [2019-12-27 Fri 17:04]--[2019-12-27 Fri 17:06] =>  0:02
- Refiled on [2019-12-26 Thu 13:51]
CLOCK: [2019-12-25 Wed 15:46]--[2019-12-25 Wed 15:47] =>  0:01
:END:
#+begin_quote
  DOING [#A] try this email |- Adam Porter <adam@alphapapa.net>: Re: Asynchronous org-agenda-redo  2d ago                                                :COMMON:EMAIL:
            	get_started_org_mode:	 -0.9x	DONE [#A] try to play with options by removing DOUG_LEA_MALLOC conds email |- Eli Zaretskii <eliz@gnu.org>: Re: bug#38345: 27.0.50; Permanent increase in memory consumption after opening images (or pdfs) :COMMON::EMAIL:
            	get_started_org_mode:	 -0.9x	DOING [#A] benchmark agenda after 1 day running                                                            :COMMON::
#+end_quote
***** DONE [#A] subtree agenda restriction seems to be ignored
CLOSED: [2019-12-27 Fri 17:10] SCHEDULED: <2019-12-27 Fri>
:PROPERTIES:
:CREATED:  [2019-12-27 Fri 16:34]
:ARCHIVE_TIME: 2019-12-30 Mon 10:38
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2019-12-27 Fri 17:10]
CLOCK: [2019-12-27 Fri 17:06]--[2019-12-27 Fri 17:10] =>  0:04
:END:
***** MERGED [#A] make org-ql format agenda items better
CLOSED: [2019-12-30 Mon 11:52] SCHEDULED: <2020-01-04 Sat>
:PROPERTIES:
:CREATED: [2019-12-22 Sun 21:35]
:SHOWFROMDATE: 2019-12-28
:ARCHIVE_TIME: 2020-01-09 Thu 16:02
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Agenda & scheduling/Trying =org-ql=
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: MERGED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "MERGED"     from "NEXT"          [2019-12-30 Mon 11:52]
CLOCK: [2019-12-27 Fri 16:59]--[2019-12-27 Fri 17:04] =>  0:05
- Refiled on [2019-12-23 Mon 18:08]
- Refiled on [2019-12-23 Mon 10:57]
:END:
